#Бондаренков Ум-252 Практика 3
#Задание 1
#1.2
a=int(input('введите двузначное число: '))
if(a//10 == a%10):
    print('Да')
else:
    print('Нет')