#Бондаренков Ум-252 Практика 5
#Задание 5

text=input('Введите текст: ')
print('Результат: ',text.lower())