#Бондаренков Ум-252 Практика 5
#Задание 1

text=input('Введите текст: ')
text=' ' + text
print('Количество слов начинающихся с \"е\":', text.count(' е'))