#Бондаренков Ум-252 Практика 5
#Задание 2

text=input('Введите текст: ')
print('Результат замены:',text.replace(':','%'), '\nКоличество замен: ',text.count(':'))