#Бондаренков Ум-252 Практика 5
#Задание 4

text=input('Введите текст: ')
print('Результат замены:',text.replace('а','о'), '\nКоличество замен: ',text.count('а'), '\nКоличество символов', len(text))