#Бондаренков Ум-252 Практика 5
#Задание 8 

text='Дана строка, заканчивающаяся точкой.'

print('количество ', len(text.split()))