#Бондаренков Ум-252 Практика 5
#Задание 6

text=input('Введите текст: ')
print('Результат:',text.replace('а',''), '\nУдалено: ',text.count('а'))