#Бондаренков Ум-252 Практика 4
#Задание 6

n=int(input("Введите число: "))
s=1
for i in range(n):
    s*=(i+1)
print('Факториал числа',n, 'равен ',s)