#Бондаренков Ум-252 Практика 4
#Задание 4

n=int(input("количество чисел: "))
s=0
for i in range(n):
    a=int(input('Введите число: '))
    s+=a
print('Сумма =',s)