#Бондаренков Ум-252 Практика 4
#Задание 7

n=int(input("Введите число: "))
p=1
s=0
for i in range(n):
    p*=(i+1)
    s+=p
print('Сумма: ',s)