#Бондаренков Ум-252 Практика 4
#Задание 5

n=int(input("Введите число: "))
s=0
for i in range(n):
    s+=(i+1)**3
print('Сумма =',s)